/* 门派列表 */
const staticData = {
	faction: {
		0: '玄天宗',
		1: '无极宗',
		2: '神道宗',
		3: '魔神宗',
		4: '落云宗',
		5: '飘渺宗',
		6: '回音谷',
		7: '凤鸣宗',
		8: '青鸾宗',
		9: '天机宗',
		10: '离药宗',
		11: '万药宗',
		12: '九鼎宗',
		13: '丹鼎宗',
		14: '青丹宗',
		15: '落霞宗',
		16: '清风宗',
		17: '星陨宗',
		18: '阙云宗',
		19: '唐门',
		20: '武魂殿'
	},
	bindbox: {
		1: {
			id: 1,
			name: '初级盲盒',
			price: 1,
			pic: require('@/static/public/blindbox/icon-blindBox-style1.png')
		},
		2: {
			id: 2,
			name: '中级盲盒',
			price: 2,
			pic: require('@/static/public/blindbox/icon-blindBox-style2.png')
		},
		3: {
			id: 3,
			name: '高级盲盒',
			price: 3,
			pic: require('@/static/public/blindbox/icon-blindBox-style3.png')
		},
	},
	color: {
		100000000000: {
			color: '灰色', //颜色
			baseHashRate: 100, //基础算力
			experience: 100, //经验值
			paymentQuantity: 1 //平台币兑换
		},
		200000000000: {
			color: '紫色',
			baseHashRate: 1000, //基础算力
			experience: 200, //经验值
			paymentQuantity: 10 //平台币兑换
		},
		300000000000: {
			color: '黑色',
			baseHashRate: 10000, //基础算力
			experience: 400, //经验值
			paymentQuantity: 100 //平台币兑换
		},
		400000000000: {
			color: '红色',
			baseHashRate: 100000, //基础算力
			experience: 800, //经验值
			paymentQuantity: 1000 //平台币兑换
		},
		500000000000: {
			color: '黄色',
			baseHashRate: 1000000, //基础算力
			experience: 1600, //经验值
			paymentQuantity: 10000 //平台币兑换
		}
	},
	card: {
		1000000000: '唐三',
		2000000000: '小舞',
		3000000000: '戴沐白',
		4000000000: '奥斯卡',
		5000000000: '马红俊',
		6000000000: '宁荣荣',
		7000000000: '朱竹清',
		8000000000: '唐昊',
		9000000000: '阿银',
		10000000000: '独孤博',
		11000000000: '宁风致',
		12000000000: '白沉香',
		13000000000: '尘心',
		14000000000: '古榕',
		15000000000: '柳二龙',
		16000000000: '白鹤',
		17000000000: '泰坦',
		18000000000: '比比东',
		19000000000: '千仞雪',
		20000000000: '波塞西',
		21000000000: '千寻疾',
		22000000000: '胡列娜',
		23000000000: '月关',
		24000000000: '佘龙',
		25000000000: '水冰儿',
		26000000000: '唐月华',
		27000000000: '欧亚',
		28000000000: '雪崩',
		29000000000: '雪夜大帝',
		30000000000: '风笑天',
	}
}
export default staticData
